# nlp_patterns.py

# Паттерны для SpaCy Matcher
# Каждый ключ словаря - это имя интента.
# Значение - это список паттернов для этого интента.
# Каждый паттерн - это список словарей, описывающих токены.

NLP_PATTERNS = {
    "GET_WEATHER": [
        [{"LEMMA": "погода"}, {"LOWER": "в"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}], # "погода в москве"
        [{"LEMMA": "какой"}, {"LEMMA": "погода"}, {"LOWER": "в"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}] # "какая погода в"
    ],
    "GET_FORECAST": [
        [{"LEMMA": "прогноз"}, {"LOWER": "на"}, {"LOWER": {"IN": ["завтра", "послезавтра", "сегодня", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье"]}}, {"LOWER": "в", "OP": "?"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}],
        [{"LEMMA": "прогноз"}, {"LEMMA": "погода"}, {"LOWER": "в"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}, {"LOWER": "на"}, {"LOWER": {"IN": ["завтра", "послезавтра", "сегодня", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье"]}}]
    ],
    "SUBSCRIBE": [
        [{"LEMMA": {"IN": ["подписать", "подписаться"]}}, {"LOWER": "меня", "OP": "?"}, {"LOWER": "на"}, {"LEMMA": "погода", "OP": "?"}, {"LOWER": "в"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}],
        [{"LEMMA": {"IN": ["подписать", "подписаться"]}}, {"LOWER": "меня", "OP": "?"}, {"LOWER": "на"}, {"LOWER": {"IN": ["дождь", "ветер", "температура"]}}, {"LOWER": "в"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}]
    ],
    "UNSUBSCRIBE": [
        [{"LEMMA": {"IN": ["отписать", "отписаться"]}}, {"LOWER": "от"}, {"LEMMA": "погода", "OP": "?"}, {"LOWER": "в"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}],
        [{"LEMMA": {"IN": ["не", "нет"]}}, {"LEMMA": "хотеть"}, {"LEMMA": "получать"}, {"LEMMA": "уведомление"}, {"LOWER": "из", "OP": "?"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}]
    ],
    "MODIFY_SUBSCRIPTION": [
        [{"LEMMA": {"IN": ["изменить", "обновить"]}}, {"LEMMA": "подписка"}, {"LOWER": "в", "OP": "?"}, {"POS": "PROPN", "OP": "*"}, {"IS_ALPHA": True, "OP": "*"}]
    ],
    "GET_SUBSCRIPTIONS": [
        [{"LEMMA": "мой"}, {"LEMMA": "подписка"}],
        [{"LEMMA": "показать"}, {"LEMMA": "мой"}, {"LEMMA": "подписка"}]
    ]
}

KNOWN_CITIES = ["москва", "санкт-петербург", "спб", "питер", "лондон", "нью-йорк", "париж"]


CONDITION_KEYWORDS = {
    "дождь": "rain",
    "ветер": "wind",
    "температура": "temperature",

}

DAY_MAPPINGS = {
    "понедельник": 0,
    "вторник": 1,
    "среда": 2,
    "четверг": 3,
    "пятница": 4,
    "суббота": 5,
    "воскресенье": 6
}